//
//  DataManager.swift
//  AnimalsForKods
//
//  Created by Artem Grebenkin on 10/12/19.
//  Copyright © 2019 Вадим Гамзаев. All rights reserved.
//

import Foundation

class DataManager {
    static let shared = DataManager()
    
    let firstPartName = ["Ко","Пан","Мед","Св","О","Но"]
    
    let secondPartName = ["ро","д","ве","ин","ле","со"]
    
    let thirdPartName = ["ва","а","дь","ья","нь","рог"]
    
    let firstPartDiscription = ["Дает много вкусного молока и мяса.",
                                "Можно погладить и сфотографироваться.",
                                "Смешно косолапит.",
                                "С маленьким, смешным хвостиком - крючком.",
                                "Сзади не подходи! Лягнет мало не покажется!",
                                "С маленьким хвостиком, но огромной жопой!"]
    
    let secondPartDiscription = ["Доброе животное которое живет с людьми.",
                                 "Лазает по деревьям в поисках еды.",
                                 "Сильные лапы и длиные когти, быстро заставят забыть об охоте.",
                                 "Кусок сало лежащего в луже.",
                                 "Быстро мчится из леса напролом.",
                                 "Любимое место - болото."]
    
    let thirdPartDiscription = ["Вечно жует траву и говорит Мууу.",
                                "Имеет грусные и добрые глаза.",
                                "Рычит, огромная пасть со страшными зубами.",
                                "Сонные маленькие глазки вечно ищут пожрать.",
                                "Умный и гордый взгляд. С огромными рогами.",
                                "Огромный рог на носу - не повод для шуток."]
    
}
